{"posts":[
 {
   "title":"14-02-2017",
   "text": "My internship will start tomorrow. Today I spend time on setting this blog up."
 },
 {
   "title":"15-02-2017",
   "text": "Day 1: Due to a medical circumstances, Mayan Death Robots' Xbox Release was postponed for a few weeks. The focus is still to get bugs removed from the xbox build, and to make sure it's confirm to requirements to release on the xbox store. Today i started with checking some of those requirements and playtesting in search for bugs. After that i reviewed the different media channels in search for more errors or outdated content. And playtested some more."
 },
 {
   "title":"16-02-2017",
   "text": "Day 2: I continued playtesting MDR, this time more focussed on performance issues. We thoughed together on which way is best to resolve framedrops in certain levels. and we started playtesting multiplayer. We also talked about which prroject would be best to workk on after GDC."
 },
 {
   "title":"17-02-2017",
   "text": "Day 3: We continued to playtest and found some more minor bugs and resolved for what was worth. these were final things to change before submitting MDR for certification. I also brainstormed a bit for marketting idea's"
 },
 {
   "title":"20-02-2017",
   "text": "Day 4: Today there was little to do for me, I explored MDR's codebase, out of interrest and worked a bit on a personal project. Tomorrow we will start something new. "
 },
 {
   "title":"21-02-2017",
   "text": "Day 5: the plan is to build every week a new game and focus each time on 1 or 2 technical aspects which we engineer indepth. We started brainstorming new ideas for technical aspects and search for 2 that would work together. wo chose modular building, and inventories, and started developing arround that, on a modular mech game."
 },
 {
   "title":"22-02-2017",
   "text": "Day 6: I continued working: I made the system to store the modular systems yesterday, and worked on the editor today. Karel worked on the inventory system."
 },
 {
   "title":"23-02-2017",
   "text": "Day 7: We continued working and finished an early proof of concept. you can drive arround on tracks and pickup scrap modules. You can enter edit mech mode to add them to your mech and create crazy shapes and forms.  and resume driving arround while trying to not get out of balance. the heavier your mech, the higher your score. https://twitter.com/SileniStudios/status/834803497820422144"
 },
 {
   "title":"13-03-2017",
   "text": "Day 8: During the last 2 weeks, Karel went to to GDC and has been thinkimg about new game concepts. and has formed an idea on which direction he wants to go next. The idea involves a map generator and he stumbled upon the fact that there doesn't exist a noise editor asset for Unity. So past week he started making one, which isn't finished yet. I will continue on improving it."
 },
 {
   "title":"14-03-2017",
   "text": "Day 9: I continued working on the noise editor: added multithreading to rendering, improved hownseeds worked, and fixed interactionbugs. In the afternoon we veryfied the quality of the localisation of Mayan Death Robots and  playtested, which resulted in barely any bugs. Quite ready for launch."
 },
 {
   "title":"15-03-2017",
   "text": "Day 10: I continued to work on the noise editor. made save and load, made small previews of nodeswhich keep live up-to-date. and discussed gamedesign "
 },
 {
   "title":"16-03-2017",
   "text": "Day 11: We playtested some more Mayan Death Robots, and found a few new bugs, in the afternoon I worked on the noise editor and added color scale functionality"
 },
 {
   "title":"17-03-2017",
   "text": "Day 12:I  worked some more on the noise editor and we discussed gamedesign of the game."
 },
 {
   "title":"20-03-2017",
   "text": "Day 13: I added controls for the curve editor and fix some issues"
 },
 {
   "title":"21-03-2017",
   "text": "Day 14: I studied the other code by Karel and implemented a turn/round system into the gamr. At the end of the day I did some indisign work for folders for EGX Rezzed next week."
 },
 {
   "title":"27-03-2017",
   "text": "Day 15: I made tiles just flip when you approach them and refacfored movement. I also rreworked visuals, and added UIinfo widgets for every player."
 },
 {
   "title":"28-03-2017",
   "text": "Day 16: I refactored code today. Tomorrow karel will leave to EGX to exhibit Mayan Death Robots. We will continue the 10th of April."
 },
 {
   "title":"10-04-2017",
   "text": "Day 17: Xbox requested an update of the xdk for mayan death robots which also required a small update in unityversion. So today we play tested a lot, an found several major bugs. "
 },
 {
   "title":"11-04-2017",
   "text": "Day 18: After a bit more testing, we diced to submit MDR again for verification. We brainstormed about a new gameidea to explore, and decided on a mobile game where you smash chests with swords, hoping to get a better sword out of the chest.."
 },
 {
   "title":"12-04-2017",
   "text": "Day 19: I focused on making a good sword animation that reacts well on the gyroscope. for this i abstracted and smoothed the gyro input and used this as input for calculating nice sword slashes."
 },
 {
   "title":"13-04-2017",
"text": "Day 19: I reanged the screen layout and reworked how the animation code works in a more clean and extendable manner"
 }

]}
